cmsis-svd/cmsis-svd/data/Geehy/APM32F00x.svd
<?xml version="1.0" encoding="utf-8" standalone="no"?>
<!-- File naming: <gigadevice>_<APM32F00x>.svd -->
<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1_1.xsd">
    <name>APM32F00x</name>
    <version>1.0</version>
    <description>APM32F00x  SVD
  APM32F00x ARM 32-bit Cortex-M0 Microcontroller based device</description>
    <cpu>
        <name>CM0+</name>
        <revision>r0p0</revision>
        <endian>little</endian>
        <mpuPresent>0</mpuPresent>
        <fpuPresent>0</fpuPresent>
        <nvicPrioBits>4</nvicPrioBits>
        <vendorSystickConfig>0</vendorSystickConfig>
    </cpu> 
    <addressUnitBits>8</addressUnitBits>
    <width>32</width>
    <!--Bus Interface Properties-->
    <!--the maximum data bit width accessible within a single transfer-->
    <!--Cortex-M3 is byte addressable-->
    <!--Register Default Properties-->
    <size>0x20</size>
    <resetValue>0x0</resetValue>
    <resetMask>0xFFFFFFFF</resetMask>
    <peripherals>
        <peripheral>
            <name>GPIOA</name>
            <description>General purpose I/O</description>
            <groupName>GPIO</groupName>
            <baseAddress>0x40000000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>EINTA</name>
                <description>Popt A external interrupts</description>
                <value>3</value>
            </interrupt>
            <registers>
                <register>
                    <name>DOUT</name>
                    <displayName>DOUT</displayName>
                    <description>Port output data register
(GPIOn_DOUT)</description>
                    <addressOffset>0x00</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DOUT0</name>
                            <description>Port output data 0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DOUT1</name>
                            <description>Port output data 1</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DOUT2</name>
                            <description>Port output data 2</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DOUT3</name>
                            <description>Port output data 3</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DOUT4</name>
                            <description>Port output data 4</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DOUT5</name>
                            <description>Port output data 5</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DOUT6</name>
                            <description>Port output data 6</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DOUT7</name>
                            <description>Port output data 7</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIN</name>
                    <displayName>DIN</displayName>
                    <description>Port input data register
(GPIOn_DIN)</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DIN0</name>
                            <description>Port input data 0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DIN1</name>
                            <description>Port input data 1</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DIN2</name>
                            <description>Port input data 2</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DIN3</name>
                            <description>Port input data 3</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DIN4</name>
                            <description>Port input data 4</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DIN5</name>
                            <description>Port input data 5</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DIN6</name>
                            <description>Port input data 6</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DIN7</name>
                            <description>Port input data 7</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MODE</name>
                    <displayName>MODE</displayName>
                    <description>Port data data register
(GPIOnMODE)</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MODE0</name>
                            <description>ouput mode 0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MODE1</name>
                            <description>ouput mode 1</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MODE2</name>
                            <description>ouput mode 2</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MODE3</name>
                            <description>ouput mode 3</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MODE4</name>
                            <description>ouput mode 4</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MODE5</name>
                            <description>ouput mode 5</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MODE6</name>
                            <description>ouput mode 6</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MODE7</name>
                            <description>ouput mode 7</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTRL1</name>
                    <displayName>CTRL1</displayName>
                    <description>Port configuration register 1
(GPIOn_CTRL1)</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CR0</name>
                            <description>Port configuration</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CR1</name>
                            <description>Port configuration</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CR2</name>
                            <description>Port configuration</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CR3</name>
                            <description>Port configuration</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CR4</name>
                            <description>Port configuration</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CR5</name>
                            <description>Port configuration</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CR6</name>
                            <description>Port configuration</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CR7</name>
                            <description>Port configuration</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTRL2</name>
                    <displayName>CTRL2</displayName>
                    <description>Port configuration register 2
(GPIOn_CTRL2)</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CR0</name>
                            <description>Port configuration</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CR1</name>
                            <description>Port configuration</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CR2</name>
                            <description>Port configuration</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CR3</name>
                            <description>Port configuration</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CR4</name>
                            <description>Port configuration</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CR5</name>
                            <description>Port configuration</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CR6</name>
                            <description>Port configuration</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CR7</name>
                            <description>Port configuration</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
