cmsis-svd/cmsis-svd/data/Geehy/APM32F00x.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="GPIOA">
            <name>GPIOB</name>
            <baseAddress>0x40000400</baseAddress>
            <interrupt>
                <name>EINTB</name>
                <description>Popt B external interrupts</description>
                <value>4</value>
            </interrupt>
        </peripheral>
        <peripheral derivedFrom="GPIOA">
            <name>GPIOC</name>
            <baseAddress>0x40000800</baseAddress>
            <interrupt>
                <name>EINTC</name>
                <description>Popt C external interrupts</description>
                <value>5</value>
            </interrupt>
        </peripheral>
        <peripheral derivedFrom="GPIOA">
            <name>GPIOD</name>
            <baseAddress>0x40000C00</baseAddress>
            <interrupt>
                <name>EINTD</name>
                <description>Popt D external interrupts</description>
                <value>6</value>
            </interrupt>
        </peripheral>
        <peripheral>
            <name>RCM</name>
            <description>Reset and Clock Management</description>
            <groupName>RCM</groupName>
            <baseAddress>0x40010000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>RCM</name>
                <description>Clock controller interrupt</description>
                <value>2</value>
            </interrupt>
            <registers>
                <register>
                    <name>ICC</name>
                    <displayName>ICC</displayName>
                    <description>Internal Clocks Control Register</description>
                    <addressOffset>0x00</addressOffset>
                    <size>0x08</size>
                    <resetValue>0x00000001</resetValue>
                    <fields>
                        <field>
                            <name>HIRCEN</name>
                            <description>High speed internal RC oscillator enable</description>
                            <access>read-write</access>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HIRCRF</name>
                            <description>High speed internal RC oscillator ready</description>
                            <access>read-only</access>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FWFHEN</name>
                            <description>Fast Wake-up from Active Halt/Halt mode</description>
                            <access>read-write</access>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LIRCEN</name>
                            <description>Low speed internal RC oscillator enable</description>
                            <access>read-write</access>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LIRCRF</name>
                            <description>Low speed internal oscillator ready</description>
                            <access>read-only</access>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RPOEN</name>
                            <description>Slow Wake-up from  Active Halt/Halt modes</description>
                            <access>read-write</access>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ECC</name>
                    <displayName>ECC</displayName>
                    <description>External Interrupt Control Register for PORTE and TLI</description>
                    <addressOffset>0x04</addressOffset>
                    <size>0x08</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HXTEN</name>
                            <description>High speed external crystal oscillator enable</description>
                            <access>read-write</access>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HXTRF</name>
                            <description>High speed external crystal oscillator ready</description>
                            <access>read-only</access>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MCS</name>
                    <displayName>MCS</displayName>
                    <description>Clock Master Status Register</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x000000E1</resetValue>
                    <fields>
                        <field>
                            <name>MCS</name>
                            <description>Clock master status bits</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MCC</name>
                    <displayName>MCC</displayName>
                    <description>Clock Master Switch Register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x000000E1</resetValue>
                    <fields>
                        <field>
                            <name>MCC</name>
                            <description>Clock master selection bits</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CSC</name>
                    <displayName>CSC</displayName>
                    <description>Switch Control Register</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CSBF</name>
                            <description>Switch busy flag</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CSEN</name>
                            <description>Switch start/stop</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CSIE</name>
                            <description>Clock switch interrupt enable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CSIF</name>
                            <description>Clock switch interrupt flag</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CLKDIV</name>
                    <displayName>CLKDIV</displayName>
                    <description>Clock Divider Register</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000018</resetValue>
                    <fields>
                        <field>
                            <name>CPUDIV</name>
                            <description>High speed internal clock prescaler</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>HIRCDIV</name>
                            <description>CPU clock prescaler</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>HDS</name>
                            <description>HDS</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>APBEN1</name>
                    <displayName>APBEN1</displayName>
                    <description>APB peripheral clock enable register1</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x000000FF</resetValue>
                    <fields>
                        <field>
                            <name>I2CCEN</name>
                            <description>I2C clock enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPICEN</name>
                            <description>SPI clock enable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UART1CEN</name>
                            <description>UART1 clock enabl</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TMR4CEN</name>
                            <description>Timer 4 clock enable</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TMR2CEN</name>
                            <description>Timer 2 clock enable</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TMR1CEN</name>
                            <description>Timer 1 clock enable</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CSS</name>
                    <displayName>CSS</displayName>
                    <description>Clock security system register</description>
                    <addressOffset>0x20</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CSSEN</name>
                            <description>Clock security system enable</description>
                            <access>read-write</access>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BCEN</name>
                            <description>Auxiliary oscillator connected to master clock</description>
                            <access>read-only</access>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CSSFDIE</name>
                            <description>Clock security system detection interrupt enable</description>
                            <access>read-write</access>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CSSFDIF</name>
                            <description>Clock security system detection</description>
                            <access>read-write</access>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>COC</name>
                    <displayName>COC</displayName>
                    <description>clock output control register</description>
                    <addressOffset>0x24</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>COEN</name>
                            <description>Configurable clock output enable</description>
                            <access>read-write</access>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>COS</name>
                            <description>Configurable clock output selection</description>
                            <access>read-write</access>
                            <bitOffset>1</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>CORF</name>
                            <description>Configurable clock output ready</description>
                            <access>read-only</access>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>COBF</name>
                            <description>Configurable clock output busy</description>
                            <access>read-only</access>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>APBEN2</name>
                    <displayName>APBEN2</displayName>
                    <description>APB peripheral clock enable register2</description>
                    <addressOffset>0x28</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x000000FF</resetValue>
                    <fields>
                        <field>
                            <name>WUPTCEN</name>
                            <description>AWU clock enable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ADCCEN</name>
                            <description>ADC clock enable</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HIRCTRIM</name>
                    <displayName>HIRCTRIM</displayName>
                    <description>HIRC clock calibration trimming register</description>
                    <addressOffset>0x30</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TRIM</name>
                            <description>High speed internal oscillator trimmer</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RSTSTS</name>
                    <displayName>RSTSTS</displayName>
                    <description>Reset status register</description>
                    <addressOffset>0x38</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>WWDTRF</name>
                            <description>WWDG reset flag bit mask</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IWDTRF</name>
                            <description>IWDG reset flag bit mask</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EMCRF</name>
                            <description>EMC reset flag bit mask</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>APBEN3</name>
                    <displayName>APBEN3</displayName>
                    <description>APB peripheral clock enable register3</description>
                    <addressOffset>0x3C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TMR1ACEN</name>
                            <description>TMR1 clock enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UART2CEN</name>
                            <description>UART2 clock enable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UART3CEN</name>
                            <description>UART3 clock enable</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
