cmsis-svd/cmsis-svd/data/Geehy/APM32F00x.svd
                <register>
                    <name>CH2OC</name>
                    <displayName>CH2OC</displayName>
                    <description>CC mode register 2</description>
                    <addressOffset>0x24</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MODESEL</name>
                            <description>Capture/Compare 2 Selection mask.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>OCFEN</name>
                            <description>Output Compare 2 Fast Enable mask.</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OCBEN</name>
                            <description>Output Compare 2 Preload Enable mask.</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OCMS</name>
                            <description>Output Compare 2 Mode mask.</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>OCCEN</name>
                            <description>Input Capture 2 Filter mask.</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH2IC</name>
                    <displayName>CH2IC</displayName>
                    <description>IC mode register 2</description>
                    <alternateRegister>CH2OC</alternateRegister>
                    <addressOffset>0x24</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MODESEL</name>
                            <description>Capture/Compare 1 Selection mask.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>ICD</name>
                            <description>ICD</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>ICFC</name>
                            <description>ICFC</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH3OC</name>
                    <displayName>CH3OC</displayName>
                    <description>CC mode register 3</description>
                    <addressOffset>0x28</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MODESEL</name>
                            <description>Capture/Compare 3 Selection mask.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>OCFEN</name>
                            <description>Output Compare 3 Fast Enable mask.</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OCBEN</name>
                            <description>Output Compare 3 Preload Enable mask.</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OCMS</name>
                            <description>Output Compare 3 Mode mask.</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>OCCEN</name>
                            <description>Input Capture 3 Filter mask.</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH3IC</name>
                    <displayName>CH3IC</displayName>
                    <description>IC mode register 3</description>
                    <alternateRegister>CH3OC</alternateRegister>
                    <addressOffset>0x28</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MODESEL</name>
                            <description>Capture/Compare 1 Selection mask.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>ICD</name>
                            <description>ICD</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>ICFC</name>
                            <description>ICFC</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH4OC</name>
                    <displayName>CH4OC</displayName>
                    <description>CC mode register 4</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MODESEL</name>
                            <description>Capture/Compare 4 Selection mask.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>OCFEN</name>
                            <description>Output Compare 4 Fast Enable mask.</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OCBEN</name>
                            <description>Output Compare 4 Preload Enable mask.</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OCMS</name>
                            <description>Output Compare 4 Mode mask.</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>OCCEN</name>
                            <description>Input Capture 4 Filter mask.</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH4IC</name>
                    <displayName>CH4IC</displayName>
                    <description>IC mode register 4</description>
                    <alternateRegister>CH4OC</alternateRegister>
                    <addressOffset>0x2C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MODESEL</name>
                            <description>Capture/Compare 1 Selection mask.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>ICD</name>
                            <description>ICD</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>ICFC</name>
                            <description>ICFC</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CHCTRL1</name>
                    <displayName>CHCTRL1</displayName>
                    <description>CC enable register 1</description>
                    <addressOffset>0x30</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CH1CCEN</name>
                            <description>Capture/Compare 1 output enable mask.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH1CCP</name>
                            <description>Capture/Compare 1 output Polarity mask.</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH1OCNEN</name>
                            <description>Capture/Compare 1 Complementary output enable mask.</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH1OCNP</name>
                            <description>Capture/Compare 1 Complementary output Polarity mask.</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH2CCEN</name>
                            <description>Capture/Compare 2 output enable mask.</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH2CCP</name>
                            <description>Capture/Compare 2 output Polarity mask.</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH2OCNEN</name>
                            <description>Capture/Compare 2 Complementary output enable mask.</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH2OCNP</name>
                            <description>Capture/Compare 2 Complementary output Polarity mask.</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CHCTRL2</name>
                    <displayName>CHCTRL2</displayName>
                    <description>CC enable register 2</description>
                    <addressOffset>0x34</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CH3CCEN</name>
                            <description>Capture/Compare 3 output enable mask.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH3CCP</name>
                            <description>Capture/Compare 3 output Polarity mask.</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH4CCEN</name>
                            <description>Capture/Compare 3 Complementary output enable mask.</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH4CCP</name>
                            <description>Capture/Compare 3 Complementary output Polarity mask.</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CNT1</name>
                    <displayName>CNT1</displayName>
                    <description>counter high</description>
                    <addressOffset>0x38</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CNT</name>
                            <description>Counter Value (MSB) mask.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CNT0</name>
                    <displayName>CNT0</displayName>
                    <description>counter low</description>
                    <addressOffset>0x3C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CNT</name>
                            <description>Counter Value (LSB) mask.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIV1</name>
                    <displayName>DIV1</displayName>
                    <description>prescaler high</description>
                    <addressOffset>0x40</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DIV</name>
                            <description>Prescaler Value (MSB) mask.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIV0</name>
                    <displayName>DIV0</displayName>
                    <description>prescaler low</description>
                    <addressOffset>0x44</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DIV</name>
                            <description>Prescaler Value (LSB) mask.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AUTORLD1</name>
                    <displayName>AUTORLD1</displayName>
                    <description>auto-reload register high</description>
                    <addressOffset>0x48</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RELOAD</name>
                            <description>Autoreload Value (MSB) mask.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AUTORLD0</name>
                    <displayName>AUTORLD0</displayName>
                    <description>auto-reload register low</description>
                    <addressOffset>0x4C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RELOAD</name>
                            <description>Autoreload Value (LSB) mask.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>REPCNT</name>
                    <displayName>REPCNT</displayName>
                    <description>Repetition Counter register</description>
                    <addressOffset>0x50</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x000000FF</resetValue>
                    <fields>
                        <field>
                            <name>REPCNT</name>
                            <description>Repetition Counter Value mask.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH1CC1</name>
                    <displayName>CH1CC1</displayName>
                    <description>capture/compare register 1 high</description>
                    <addressOffset>0x54</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CC</name>
                            <description>Capture/Compare 1 Value (MSB) mask.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH1CC0</name>
                    <displayName>CH1CC0</displayName>
                    <description>capture/compare register 1 low</description>
                    <addressOffset>0x58</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CC</name>
                            <description>Capture/Compare 1 Value (LSB) mask.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH2CC1</name>
                    <displayName>CH2CC1</displayName>
                    <description>capture/compare register 2 high</description>
                    <addressOffset>0x5C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CC</name>
                            <description>Capture/Compare 2 Value (MSB) mask.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH2CC0</name>
                    <displayName>CH2CC0</displayName>
                    <description>capture/compare register 2 low</description>
                    <addressOffset>0x60</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CC</name>
                            <description>Capture/Compare 2 Value (LSB) mask.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
