cmsis-svd/cmsis-svd/data/Geehy/APM32F00x.svd
                <register>
                    <name>CH3CC1</name>
                    <displayName>CH3CC1</displayName>
                    <description>capture/compare register 3 high</description>
                    <addressOffset>0x64</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CC</name>
                            <description>Capture/Compare 3 Value (MSB) mask.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH3CC0</name>
                    <displayName>CH3CC0</displayName>
                    <description>capture/compare register 3 low</description>
                    <addressOffset>0x68</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CC</name>
                            <description>Capture/Compare 3 Value (LSB) mask.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH4CC1</name>
                    <displayName>CH4CC1</displayName>
                    <description>capture/compare register 4 high</description>
                    <addressOffset>0x6C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CC</name>
                            <description>Capture/Compare 4 Value (MSB) mask.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH4CC0</name>
                    <displayName>CH4CC0</displayName>
                    <description>capture/compare register 4 low</description>
                    <addressOffset>0x70</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000FFF</resetValue>
                    <fields>
                        <field>
                            <name>CC</name>
                            <description>Capture/Compare 4 Value (LSB) mask.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>BRKCTRL</name>
                    <displayName>BRKCTRL</displayName>
                    <description>Break Register</description>
                    <addressOffset>0x74</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000003</resetValue>
                    <fields>
                        <field>
                            <name>PROTCFG</name>
                            <description>Lock Configuration mask.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>IMOS</name>
                            <description>Off-State Selection for Idle mode mask.</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RMOS</name>
                            <description>Off-State Selection for Run mode mask.</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BRKEN</name>
                            <description>Break Enable mask.</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BRKPOL</name>
                            <description>Break Polarity mask.</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>AOEN</name>
                            <description>Automatic Output Enable mask.</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WOEN</name>
                            <description>Main Output Enable mask.</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DTS</name>
                    <displayName>DTS</displayName>
                    <description>dead-time register</description>
                    <addressOffset>0x78</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DT</name>
                            <description>Dead-Time Generator set-up mask.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ISO</name>
                    <displayName>ISO</displayName>
                    <description>Output idle register</description>
                    <addressOffset>0x7C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CH1ISO</name>
                            <description>Output Idle state 1 (OC1 output) mask.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH1NISO</name>
                            <description>Output Idle state 1 (OC1N output) mask.</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH2ISO</name>
                            <description>Output Idle state 2 (OC2 output) mask.</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH2NISO</name>
                            <description>Output Idle state 2 (OC2N output) mask.</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH3ISO</name>
                            <description>Output Idle state 3 (OC3 output) mask.</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH3NISO</name>
                            <description>Output Idle state 3 (OC3N output) mask.</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH4ISO</name>
                            <description>Output Idle state 4 (OC4 output) mask.</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH4NISO</name>
                            <description>Output Idle state 4 (OC4N output) mask.</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CHEN</name>
                    <displayName>CHEN</displayName>
                    <description>Timer1A Channel enable register</description>
                    <addressOffset>0x84</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CH1</name>
                            <description>CH1</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH2</name>
                            <description>CH2</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH3</name>
                            <description>CH3</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH4</name>
                            <description>CH4</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
