cmsis-svd/cmsis-svd/data/Geehy/APM32F00x.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="TMR1">
            <name>TMR1A</name>
            <baseAddress>0x40001000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>TMR1A_UT</name>
                <description>TIM1 update/overflow/underflow/trigger/break interrupt</description>
                <value>29</value>
            </interrupt>
            <interrupt>
                <name>TMR1A_CC</name>
                <description>TIM1 capture/compare interrupt</description>
                <value>30</value>
            </interrupt>
        </peripheral>
        <peripheral>
            <name>TMR2</name>
            <description>16-bit timer</description>
            <groupName>TMR</groupName>
            <baseAddress>0x40003C00</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>TMR2_UO</name>
                <description>TIM2 update /overflow interrupt</description>
                <value>13</value>
            </interrupt>
            <interrupt>
                <name>TMR2_CC</name>
                <description>TIM2 capture/compare interrupt</description>
                <value>14</value>
            </interrupt>
            <registers>
                <register>
                    <name>CTRL1</name>
                    <displayName>CTRL1</displayName>
                    <description>control register 1</description>
                    <addressOffset>0x00</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CNTEN</name>
                            <description>Counter Enable mask.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NGUE</name>
                            <description>Update DIsable mask.</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UES</name>
                            <description>Update Request Source mask.</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPMEN</name>
                            <description>One Pulse Mode mask.</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ARBEN</name>
                            <description>Auto-Reload Preload Enable mask.</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTRL2</name>
                    <displayName>CTRL2</displayName>
                    <description>control register 2</description>
                    <addressOffset>0x04</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MMFC</name>
                            <description>Capture/Compare Preloaded Control mask.</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SMC</name>
                    <displayName>SMC</displayName>
                    <description>Synchro mode control register</description>
                    <addressOffset>0x08</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SMFC</name>
                            <description>Master/Slave Mode mask.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>ITC</name>
                            <description>Trigger Selection mask.</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>MSMEN</name>
                            <description>Slave Mode Selection mask.</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTCTRL</name>
                    <displayName>INTCTRL</displayName>
                    <description>interrupt enable register</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>UDIE</name>
                            <description>Update Interrupt Enable mask.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH1CCIE</name>
                            <description>Capture/Compare 1 Interrupt Enable mask.</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH2CCIE</name>
                            <description>Capture/Compare 2 Interrupt Enable mask.</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH3CCIE</name>
                            <description>Capture/Compare 3 Interrupt Enable mask.</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TRGIE</name>
                            <description>Trigger Interrupt Enable mask.</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STS1</name>
                    <displayName>STS1</displayName>
                    <description>status register 1</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>UDIF</name>
                            <description>Update Interrupt Flag mask.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH1CCIF</name>
                            <description>Capture/Compare 1 Interrupt Flag mask.</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH2CCIF</name>
                            <description>Capture/Compare 2 Interrupt Flag mask.</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH3CCIF</name>
                            <description>Capture/Compare 3 Interrupt Flag mask.</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TRGIF</name>
                            <description>Trigger Interrupt Flag mask.</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STS2</name>
                    <displayName>STS2</displayName>
                    <description>status register 2</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CH1RCF</name>
                            <description>Capture/Compare 1 Overcapture Flag mask.</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH2RCF</name>
                            <description>Capture/Compare 2 Overcapture Flag mask.</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH3RCF</name>
                            <description>Capture/Compare 3 Overcapture Flag mask.</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SCEG</name>
                    <displayName>SCEG</displayName>
                    <description>event generation register</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <access>write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>UEG</name>
                            <description>Update Generation mask.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH1CCG</name>
                            <description>Capture/Compare 1 Generation mask.</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH2CCG</name>
                            <description>Capture/Compare 2 Generation mask.</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH3CCG</name>
                            <description>Capture/Compare 3 Generation mask.</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TEG</name>
                            <description>Trigger Generation mask.</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH1OC</name>
                    <displayName>CH1CCM</displayName>
                    <description>capture/compare mode register 1 (output mode)</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MODESEL</name>
                            <description>Capture/Compare 1 Selection mask.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>OCBEN</name>
                            <description>Output Compare 1 Preload Enable mask.</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OCMS</name>
                            <description>Output Compare 1 Mode mask.</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH1IC</name>
                    <displayName>CH1CCM</displayName>
                    <description>capture/compare mode register 1 (input mode)</description>
                    <alternateRegister>CH1OC</alternateRegister>
                    <addressOffset>0x1C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MODESEL</name>
                            <description>Capture/Compare 1 Selection mask.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>ICD</name>
                            <description>Input capture 1 prescaler</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>ICFC</name>
                            <description>Input capture 1 filter</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH2OC</name>
                    <displayName>CH2CCM</displayName>
                    <description>capture/compare mode register 2 (output mode)</description>
                    <addressOffset>0x20</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MODESEL</name>
                            <description>Capture/Compare 2 Selection mask.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>OCBEN</name>
                            <description>Output Compare 2 Preload Enable mask.</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OCMS</name>
                            <description>Output Compare 2 Mode mask.</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH2IC</name>
                    <displayName>CH2CCM</displayName>
                    <description>capture/compare mode register 2 (input mode)</description>
                    <alternateRegister>CH2OC</alternateRegister>
                    <addressOffset>0x20</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MODESEL</name>
                            <description>Capture/Compare 2 Selection mask.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>ICD</name>
                            <description>Input capture 2 prescaler</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>ICFC</name>
                            <description>Input capture 2 filter</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH3OC</name>
                    <displayName>CH3CCM</displayName>
                    <description>capture/compare mode register 3 (output mode)</description>
                    <addressOffset>0x24</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MODESEL</name>
                            <description>Capture/Compare 3 Selection mask.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>OCBEN</name>
                            <description>Output Compare 3 Preload Enable mask.</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OCMS</name>
                            <description>Output Compare 3 Mode mask.</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH3IC</name>
                    <displayName>CH3CCM</displayName>
                    <description>capture/compare mode register 3 (input mode)</description>
                    <alternateRegister>CH3OC</alternateRegister>
                    <addressOffset>0x24</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MODESEL</name>
                            <description>Capture/Compare 3 Selection mask.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>ICD</name>
                            <description>Input capture 3 prescaler</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>ICFC</name>
                            <description>Input capture 3 filter</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CHCTRL1</name>
                    <displayName>CHCTRL1</displayName>
                    <description>Channel control register 1</description>
                    <addressOffset>0x28</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CH1CCEN</name>
                            <description>Capture/Compare 1 output enable mask.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH1CCP</name>
                            <description>Capture/Compare 1 output Polarity mask.</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH2CCEN</name>
                            <description>Capture/Compare 2 output enable mask.</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH2CCP</name>
                            <description>Capture/Compare 2 output Polarity mask.</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
