cmsis-svd/cmsis-svd/data/Geehy/APM32F00x.svd
                <register>
                    <name>CHCTRL2</name>
                    <displayName>CHCTRL2</displayName>
                    <description>Channel control register 2</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CH3CCEN</name>
                            <description>Capture/Compare 3 output enable mask.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CH3CCP</name>
                            <description>Capture/Compare 3 output Polarity mask.</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CNT1</name>
                    <displayName>CNT1</displayName>
                    <description>Count register 1</description>
                    <addressOffset>0x30</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CNT</name>
                            <description>Counter Value (MSB) mask.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CNT0</name>
                    <displayName>CNT0</displayName>
                    <description>Count register 0</description>
                    <addressOffset>0x34</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CNT</name>
                            <description>Counter Value (LSB) mask.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIV</name>
                    <displayName>DIV</displayName>
                    <description>divider register</description>
                    <addressOffset>0x38</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DIV</name>
                            <description>Prescaler Value mask.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AUTORLD1</name>
                    <displayName>AUTORLD1</displayName>
                    <description>Auto reload register 1</description>
                    <addressOffset>0x3C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RELOAD</name>
                            <description>Autoreload Value (MSB) mask.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AUTORLD0</name>
                    <displayName>AUTORLD0</displayName>
                    <description>Auto reload register 0</description>
                    <addressOffset>0x40</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ARR</name>
                            <description>Autoreload Value (LSB) mask.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH1CC1</name>
                    <displayName>CH1CC1</displayName>
                    <description>channel 1 compare/capture register 1</description>
                    <addressOffset>0x44</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CC</name>
                            <description>Capture/Compare 1 Value (MSB) mask.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH1CC0</name>
                    <displayName>CH1CC0</displayName>
                    <description>channel 1 compare/capture register 0</description>
                    <addressOffset>0x48</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CC</name>
                            <description>Capture/Compare 1 Value (LSB) mask.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH2CC1</name>
                    <displayName>CH2CC1</displayName>
                    <description>channel 2 compare/capture register 1</description>
                    <addressOffset>0x4C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CC</name>
                            <description>Capture/Compare 2 Value (MSB) mask.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH2CC0</name>
                    <displayName>CH2CC0</displayName>
                    <description>channel 2 compare/capture register 0</description>
                    <addressOffset>0x50</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CC</name>
                            <description>Capture/Compare 2 Value (LSB) mask.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH3CC1</name>
                    <displayName>CH3CC1</displayName>
                    <description>channel 3 compare/capture register 1</description>
                    <addressOffset>0x54</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CC</name>
                            <description>Capture/Compare 3 Value (MSB) mask.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CH3CC0</name>
                    <displayName>CH3CC0</displayName>
                    <description>channel 3 compare/capture register 0</description>
                    <addressOffset>0x58</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CC</name>
                            <description>Capture/Compare 3 Value (LSB) mask.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
