cmsis-svd/cmsis-svd/data/Geehy/APM32F00x.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>ADC</name>
            <description>Analog to digital converter</description>
            <groupName>ADC</groupName>
            <baseAddress>0x40004400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>ADC</name>
                <description>ADC global interrupt</description>
                <value>22</value>
            </interrupt>
            <registers>
                <register>
                    <name>DATABUF0</name>
                    <displayName>DATABUF</displayName>
                    <description>Data buffer 0</description>
                    <addressOffset>0x00</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATABUF0</name>
                            <description>Regular data 0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DATABUF1</name>
                    <displayName>DATABUF</displayName>
                    <description>Data buffer 0</description>
                    <addressOffset>0x04</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATABUF1</name>
                            <description>Regular data 1</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DATABUF2</name>
                    <displayName>DATABUF</displayName>
                    <description>Data buffer 0</description>
                    <addressOffset>0x08</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATABUF2</name>
                            <description>Regular data 2</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DATABUF3</name>
                    <displayName>DATABUF</displayName>
                    <description>Data buffer 0</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATABUF3</name>
                            <description>Regular data 3</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DATABUF4</name>
                    <displayName>DATABUF</displayName>
                    <description>Data buffer 0</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATABUF4</name>
                            <description>Regular data 4</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DATABUF5</name>
                    <displayName>DATABUF</displayName>
                    <description>Data buffer 0</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATABUF5</name>
                            <description>Regular data 5</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DATABUF6</name>
                    <displayName>DATABUF</displayName>
                    <description>Data buffer 0</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATABUF6</name>
                            <description>Regular data 6</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DATABUF7</name>
                    <displayName>DATABUF</displayName>
                    <description>Data buffer 0</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATABUF7</name>
                            <description>Regular data 7</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DATABUF8</name>
                    <displayName>DATABUF</displayName>
                    <description>Data buffer 0</description>
                    <addressOffset>0x20</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATABUF8</name>
                            <description>Regular data 8</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DATABUF9</name>
                    <displayName>DATABUF</displayName>
                    <description>Data buffer 0</description>
                    <addressOffset>0x24</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATABUF9</name>
                            <description>Regular data 9</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DATABUF10</name>
                    <displayName>DATABUF</displayName>
                    <description>Data buffer 0</description>
                    <addressOffset>0x28</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATABUF10</name>
                            <description>Regular data 10</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DATABUF11</name>
                    <displayName>DATABUF</displayName>
                    <description>Data buffer 0</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATABUF11</name>
                            <description>Regular data 11</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DATABUF12</name>
                    <displayName>DATABUF</displayName>
                    <description>Data buffer 0</description>
                    <addressOffset>0x30</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATABUF12</name>
                            <description>Regular data 12</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DATABUF13</name>
                    <displayName>DATABUF</displayName>
                    <description>Data buffer 0</description>
                    <addressOffset>0x34</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATABUF13</name>
                            <description>Regular data 13</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DATABUF14</name>
                    <displayName>DATABUF</displayName>
                    <description>Data buffer 0</description>
                    <addressOffset>0x38</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATABUF14</name>
                            <description>Regular data 14</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DATABUF15</name>
                    <displayName>DATABUF</displayName>
                    <description>Data buffer 0</description>
                    <addressOffset>0x3C</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATABUF15</name>
                            <description>Regular data 15</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DATABUF16</name>
                    <displayName>DATABUF</displayName>
                    <description>Data buffer 0</description>
                    <addressOffset>0x40</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATABUF16</name>
                            <description>Regular data 16</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DATABUF17</name>
                    <displayName>DATABUF</displayName>
                    <description>Data buffer 0</description>
                    <addressOffset>0x44</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATABUF17</name>
                            <description>Regular data 17</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DATABUF18</name>
                    <displayName>DATABUF</displayName>
                    <description>Data buffer 0</description>
                    <addressOffset>0x48</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATABUF18</name>
                            <description>Regular data 18</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DATABUF19</name>
                    <displayName>DATABUF</displayName>
                    <description>Data buffer 0</description>
                    <addressOffset>0x4C</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATABUF19</name>
                            <description>Regular data 19</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CSTS</name>
                    <displayName>CSTS</displayName>
                    <description>control/status register</description>
                    <addressOffset>0x80</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CHSEL</name>
                            <description>CHSEL</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>AWDIE</name>
                            <description>AWDIE</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCIE</name>
                            <description>CCIE</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>AWDF</name>
                            <description>Analog watchdog flag</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCF</name>
                            <description>Regular channel end of conversion</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTRL1</name>
                    <displayName>CTRL1</displayName>
                    <description>control register 1</description>
                    <addressOffset>0x84</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ADCON</name>
                            <description>ADCON</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCM</name>
                            <description>CCM</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DIVSEL</name>
                            <description>DIVSEL</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTRL2</name>
                    <displayName>CTRL2</displayName>
                    <description>control register 2</description>
                    <addressOffset>0x88</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SMEN</name>
                            <description>SMEN</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DAM</name>
                            <description>DAM</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ETS</name>
                            <description>ETS</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>ETEN</name>
                            <description>ETEN</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTRL3</name>
                    <displayName>CTRL3</displayName>
                    <description>control register 3</description>
                    <addressOffset>0x8C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>OVRF</name>
                            <description>OVRF</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DBEN</name>
                            <description>DBEN</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DATA1</name>
                    <displayName>DATA1</displayName>
                    <description>high-regular data register</description>
                    <addressOffset>0x90</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>Regular data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DATA0</name>
                    <displayName>DATA0</displayName>
                    <description>low-regular data register</description>
                    <addressOffset>0x94</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>Regular data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
