cmsis-svd/cmsis-svd/data/Geehy/APM32F00x.svd
                <register>
                    <name>STD1</name>
                    <displayName>STD1</displayName>
                    <description>Schmitt trigger disable register high</description>
                    <addressOffset>0x98</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>STD</name>
                            <description>Schmitt trigger prohibit high</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STD0</name>
                    <displayName>STD0</displayName>
                    <description>Schmitt trigger disable register low</description>
                    <addressOffset>0x9C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>STD</name>
                            <description>Schmitt trigger prohibit low</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AWDHT1</name>
                    <displayName>AWDHT1</displayName>
                    <description>watchdog higher threshold  register high</description>
                    <addressOffset>0xA0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000FFF</resetValue>
                    <fields>
                        <field>
                            <name>THRESHOLD</name>
                            <description>Analog watchdog higher threshold high</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AWDHT0</name>
                    <displayName>AWDHT0</displayName>
                    <description>watchdog higher threshold  register low</description>
                    <addressOffset>0xA4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000003</resetValue>
                    <fields>
                        <field>
                            <name>THRESHOLD</name>
                            <description>Analog watchdog higher threshold low</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AWDLT1</name>
                    <displayName>AWDLT1</displayName>
                    <description>watchdog lower threshold
          register high</description>
                    <addressOffset>0xA8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>LT</name>
                            <description>Analog watchdog lower
              threshold high</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AWDLT0</name>
                    <displayName>AWDLT0</displayName>
                    <description>watchdog lower threshold
          register low</description>
                    <addressOffset>0xAC</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>THRESHOLD</name>
                            <description>Analog watchdog lower
              threshold low</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AWDS1</name>
                    <displayName>AWDS1</displayName>
                    <description>Watchdog status high register</description>
                    <addressOffset>0xB0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>AWDS</name>
                            <description>Watchdog status register</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AWDS0</name>
                    <displayName>AWDS0</displayName>
                    <description>Watchdog status low register</description>
                    <addressOffset>0xB4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>AWDS</name>
                            <description>Watchdog status register</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AWDEN1</name>
                    <displayName>AWDEN1</displayName>
                    <description>Watchdog Control high register</description>
                    <addressOffset>0xB8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>AWDEN</name>
                            <description>Watchdog Control egister</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AWDEN0</name>
                    <displayName>AWDEN0</displayName>
                    <description>Watchdog Control low register</description>
                    <addressOffset>0xBC</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>AWDEN</name>
                            <description>Watchdog Control egister</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTRL4</name>
                    <displayName>CTRL4</displayName>
                    <description>Control register 4</description>
                    <addressOffset>0xC0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DISH</name>
                            <description>DISH</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GCMP</name>
                            <description>GCMP</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DFS</name>
                            <description>DFS</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>OFFSET</name>
                    <displayName>OFFSET</displayName>
                    <description>Offset register</description>
                    <addressOffset>0xC4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>OFFSET</name>
                            <description>OFFSET</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
