cmsis-svd/cmsis-svd/data/Geehy/APM32F00x.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>EINT</name>
            <description>External interrupt control</description>
            <groupName>EINT</groupName>
            <baseAddress>0x40001800</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>CTRL1</name>
                    <displayName>CTRL1</displayName>
                    <description>External Interrupt Control Register for PORTA to PORTD</description>
                    <addressOffset>0x00</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PAIT</name>
                            <description>PORTA external interrupt sensitivity bits mask</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PBIT</name>
                            <description>PORTB external interrupt sensitivity bits mask</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PCIT</name>
                            <description>PORTC external interrupt sensitivity bits mask</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PDIT</name>
                            <description>PORTD external interrupt sensitivity bits mask</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTRL2</name>
                    <displayName>CTRL2</displayName>
                    <description>External Interrupt Control Register for PORTE and TLI</description>
                    <addressOffset>0x04</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TLIT</name>
                            <description>TLIT</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CLR</name>
                    <displayName>CLR</displayName>
                    <description>External interrupt clear register</description>
                    <addressOffset>0x08</addressOffset>
                    <size>0x20</size>
                    <access>write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PAIC</name>
                            <description>PAIC</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PBIC</name>
                            <description>PBIC</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCIC</name>
                            <description>PCIC</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PDIC</name>
                            <description>PDIC</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TLIC</name>
                            <description>TLIC</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>IWDT</name>
            <description>Independent Watchdog</description>
            <groupName>IWDT</groupName>
            <baseAddress>0x40002000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>KEYWORD</name>
                    <displayName>KEYWORD</displayName>
                    <description>Key Register</description>
                    <addressOffset>0x00</addressOffset>
                    <size>0x20</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>KEY</name>
                            <description>Key Register</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIV</name>
                    <displayName>DIV</displayName>
                    <description>Prescaler Register</description>
                    <addressOffset>0x04</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DIV</name>
                            <description>Prescaler Register</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CNTRLD</name>
                    <displayName>CNTRLD</displayName>
                    <description>Reload Register</description>
                    <addressOffset>0x08</addressOffset>
                    <size>0x20</size>
                    <access>write</access>
                    <resetValue>0x000000FF</resetValue>
                    <fields>
                        <field>
                            <name>CNTRLD</name>
                            <description>Reload Register</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
