cmsis-svd/cmsis-svd/data/Geehy/APM32F00x.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>WWDT</name>
            <description>Window Watchdog</description>
            <groupName>WWDT</groupName>
            <baseAddress>0x40001C00</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>CTRL</name>
                    <displayName>CTRL</displayName>
                    <description>Control Register</description>
                    <addressOffset>0x00</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000007F</resetValue>
                    <fields>
                        <field>
                            <name>CNT</name>
                            <description>CNT</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>WWDTEN</name>
                            <description>WWDTEN</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WDDATA</name>
                    <displayName>WDDATA</displayName>
                    <description>Window Register</description>
                    <addressOffset>0x04</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000007F</resetValue>
                    <fields>
                        <field>
                            <name>WINCNT</name>
                            <description>WINCNT</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>WWDTEN</name>
                            <description>WWDTEN</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>BBEP</name>
            <description>Beeper</description>
            <groupName>BBEP</groupName>
            <baseAddress>0x40002800</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>CSTS</name>
                    <displayName>CSTS</displayName>
                    <description>External Interrupt Control Register for PORTA to PORTD</description>
                    <addressOffset>0x00</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000001F</resetValue>
                    <fields>
                        <field>
                            <name>DIV</name>
                            <description>Beeper Divider prescalar mask</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>BUZEN</name>
                            <description>Beeper enable mask</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BOFS</name>
                            <description>Beeper frequency selection mask</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>    
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>WUPT</name>
            <description>Auto wake up</description>
            <groupName>WUPT</groupName>
            <baseAddress>0x40002400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>WUPT</name>
                <description>Auto wake up from halt interrupt</description>
                <value>1</value>
            </interrupt>
            <registers>
                <register>
                    <name>CSTS</name>
                    <displayName>CSTS</displayName>
                    <description>WUPT Control status register</description>
                    <addressOffset>0x00</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CFMEN</name>
                            <description>LSI Measurement enable mask</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WUPTEN</name>
                            <description>Auto Wake-up enable mask</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WUPIF</name>
                            <description>Interrupt flag mask</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIV</name>
                    <displayName>DIV</displayName>
                    <description>WUPT Asynchronous prescaler buffer</description>
                    <addressOffset>0x04</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000003F</resetValue>
                    <fields>
                        <field>
                            <name>DIV</name>
                            <description>Asynchronous Prescaler divider mask</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TBC</name>
                    <displayName>TBC</displayName>
                    <description>WUPT Time base selection register</description>
                    <addressOffset>0x08</addressOffset>
                    <size>0x20</size>
                    <access>write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TBC</name>
                            <description>Timebase selection mask</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
