cmsis-svd/cmsis-svd/data/Geehy/APM32F00x.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>FMC</name>
            <description>Flash Interface</description>
            <groupName>FMC</groupName>
            <baseAddress>0x40011000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>FLASH</name>
                <description>Flash interrupt</description>
                <value>24</value>
            </interrupt>
            <registers>
                <register>
                    <name>CTRL1</name>
                    <displayName>CTRL1</displayName>
                    <description>Flash access control register</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000030</resetValue>
                    <fields>
                        <field>
                            <name>LATENCY</name>
                            <description>Latency</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HCAEN</name>
                            <description>Flash half cycle access
              enable</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PBEN</name>
                            <description>Prefetch buffer enable</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PBSF</name>
                            <description>Prefetch buffer status</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>KEY</name>
                    <displayName>KEY</displayName>
                    <description>Flash key register</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>KEY</name>
                            <description>FPEC key</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>OBKEY</name>
                    <displayName>OBKEY</displayName>
                    <description>Flash option key register</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>OBEYR</name>
                            <description>Option byte key</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STS</name>
                    <displayName>STS</displayName>
                    <description>Status register</description>
                    <addressOffset>0xC</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>BUSYF</name>
                            <description>BUSYF</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PEF</name>
                            <description>Programming error</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WPEF</name>
                            <description>Write protection error</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OCF</name>
                            <description>End of operation</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTRL2</name>
                    <displayName>CTRL2</displayName>
                    <description>Control register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000080</resetValue>
                    <fields>
                        <field>
                            <name>PG</name>
                            <description>Programming</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PAGEERA</name>
                            <description>Page Erase</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MASSERA</name>
                            <description>Mass Erase</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OBP</name>
                            <description>Option byte programming</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OBE</name>
                            <description>Option byte erase</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>STA</name>
                            <description>Start</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LOCK</name>
                            <description>Lock</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OBWEN</name>
                            <description>Option bytes write enable</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ERRIE</name>
                            <description>Error interrupt enable</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OCIE</name>
                            <description>End of operation interrupt
              enable</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADDR</name>
                    <displayName>ADDR</displayName>
                    <description>Flash address register</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ADDR</name>
                            <description>Flash Address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>OBCS</name>
                    <displayName>OBCS</displayName>
                    <description>Option byte register</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x03FFFFFC</resetValue>
                    <fields>
                        <field>
                            <name>OBE</name>
                            <description>OBE</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>READPROT</name>
                            <description>READPROT</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WWDTSW</name>
                            <description>WWDTSW</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WWDTRST</name>
                            <description>WWDTRST</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IWDTSW</name>
                            <description>IWDTSW</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LIRCEN</name>
                            <description>LIRCEN</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HIRCTRIM</name>
                            <description>HIRCTRIM</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NOTUSED</name>
                            <description>NOTUSED</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>DATA0</name>
                            <description>DATA0</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATA1</name>
                            <description>DATA1</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WRTPROT</name>
                    <displayName>WRTPROT</displayName>
                    <description>Write protection register</description>
                    <addressOffset>0x20</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <fields>
                        <field>
                            <name>WP</name>
                            <description>Write protect</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LPM</name>
                    <displayName>LPM</displayName>
                    <description>Low power mode register</description>
                    <addressOffset>0x24</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <fields>
                        <field>
                            <name>HALT</name>
                            <description>Power-down in Active-Halt mode</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>AHALT</name>
                            <description>Power-down in Halt mode</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TPO</name>
                    <displayName>TPO</displayName>
                    <description>tpower_on register</description>
                    <addressOffset>0x28</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <fields>
                        <field>
                            <name>TPO</name>
                            <description>TPO</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
