cmsis-svd/cmsis-svd/data/Geehy/APM32F00x.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>OB</name>
            <description>Option Bytes Registers</description>
            <groupName>OB</groupName>
            <baseAddress>0x00020400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>USER</name>
                    <displayName>USER</displayName>
                    <description>USER</description>
                    <addressOffset>0x2</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>WWDTSW</name>
                            <description>WWDTSW</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WWDTRST</name>
                            <description>WWDTRST</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IWDTSW</name>
                            <description>IWDTSW</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LIRCEN</name>
                            <description>LIRCEN</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HIRCTRIM</name>
                            <description>HIRCTRIM</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NOTUSED</name>
                            <description>NOTUSED</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>nUSER</name>
                            <description>nUSER</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DATA0</name>
                    <displayName>DATA0</displayName>
                    <description>DATA0</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x10</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATA0</name>
                            <description>DATA0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DATA1</name>
                    <displayName>DATA1</displayName>
                    <description>DATA1</description>
                    <addressOffset>0x6</addressOffset>
                    <size>0x10</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATA1</name>
                            <description>DATA1</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WRTPROT0</name>
                    <displayName>WRTPROT0</displayName>
                    <description>WRTPROT0</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>WRTPROT0</name>
                            <description>WRTPROT0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WRTPROT1</name>
                    <displayName>WRTPROT1</displayName>
                    <description>WRTPROT1</description>
                    <addressOffset>0xA</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>WRTPROT1</name>
                            <description>WRTPROT1</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WRTPROT2</name>
                    <displayName>WRTPROT2</displayName>
                    <description>WRTPROT2</description>
                    <addressOffset>0xC</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>WRTPROT2</name>
                            <description>WRTPROT2</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WRTPROT3</name>
                    <displayName>WRTPROT3</displayName>
                    <description>WRTPROT3</description>
                    <addressOffset>0xE</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>WRTPROT3</name>
                            <description>WRTPROT3</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AFR</name>
                    <displayName>AFR</displayName>
                    <description>AFR</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>AFR</name>
                            <description>AFR</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HXTCNT</name>
                    <displayName>HXTCNT</displayName>
                    <description>HXTCNT</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HXTCNT</name>
                            <description>HXTCNT</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CLKOPT</name>
                    <displayName>CLKOPT</displayName>
                    <description>CLKOPT</description>
                    <addressOffset>0x16</addressOffset>
                    <size>0x10</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>WUPTDIV</name>
                            <description>WUPTDIV</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>WUPTCS</name>
                            <description>WUPTCS</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EXTCLK</name>
                            <description>EXTCLK</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NOTUSED</name>
                            <description>NOTUSED</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>nCLKOPT</name>
                            <description>nCLKOPT</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
    </peripherals>
</device>